
## Plan Result

[CI link](https://github.com/ikigaikintore/ikigaikintore/actions/runs/7947925746)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 1 to change, 5 to destroy.</code></pre>

* Create
  * google_storage_bucket.frontend-bucket
  * google_storage_bucket_iam_binding.frontend-sa-gcs
* Update
  * google_artifact_registry_repository.artifact-repository
* Delete
  * google_project_service.firebase-apis[&#34;firebase.googleapis.com&#34;]
  * google_project_service.firebase-apis[&#34;serviceusage.googleapis.com&#34;]
  * google_project_service.firebase_apis[&#34;firebase.googleapis.com&#34;]
  * google_project_service.firebase_apis[&#34;serviceusage.googleapis.com&#34;]
  * google_project_service.network-api-resources[&#34;compute.googleapis.com&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # google_artifact_registry_repository.artifact-repository will be updated in-place
  ~ resource "google_artifact_registry_repository" "artifact-repository" {
        id               = "projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai"
        name             = "ikigai"
        # (10 unchanged attributes hidden)

      + docker_config {
          + immutable_tags = false
        }
    }

  # google_project_service.firebase-apis["firebase.googleapis.com"] will be destroyed
  # (because google_project_service.firebase-apis is not in configuration)
  - resource "google_project_service" "firebase-apis" {
      - disable_on_destroy = true -> null
      - id                 = "gig-japan-398904/firebase.googleapis.com" -> null
      - project            = "gig-japan-398904" -> null
      - service            = "firebase.googleapis.com" -> null
    }

  # google_project_service.firebase-apis["serviceusage.googleapis.com"] will be destroyed
  # (because google_project_service.firebase-apis is not in configuration)
  - resource "google_project_service" "firebase-apis" {
      - disable_on_destroy = true -> null
      - id                 = "gig-japan-398904/serviceusage.googleapis.com" -> null
      - project            = "gig-japan-398904" -> null
      - service            = "serviceusage.googleapis.com" -> null
    }

  # google_project_service.firebase_apis["firebase.googleapis.com"] will be destroyed
  # (because google_project_service.firebase_apis is not in configuration)
  - resource "google_project_service" "firebase_apis" {
      - disable_on_destroy = true -> null
      - id                 = "gig-japan-398904/firebase.googleapis.com" -> null
      - project            = "gig-japan-398904" -> null
      - service            = "firebase.googleapis.com" -> null
    }

  # google_project_service.firebase_apis["serviceusage.googleapis.com"] will be destroyed
  # (because google_project_service.firebase_apis is not in configuration)
  - resource "google_project_service" "firebase_apis" {
      - disable_on_destroy = true -> null
      - id                 = "gig-japan-398904/serviceusage.googleapis.com" -> null
      - project            = "gig-japan-398904" -> null
      - service            = "serviceusage.googleapis.com" -> null
    }

  # google_project_service.network-api-resources["compute.googleapis.com"] will be destroyed
  # (because google_project_service.network-api-resources is not in configuration)
  - resource "google_project_service" "network-api-resources" {
      - disable_on_destroy = true -> null
      - id                 = "gig-japan-398904/compute.googleapis.com" -> null
      - project            = "gig-japan-398904" -> null
      - service            = "compute.googleapis.com" -> null
    }

  # google_storage_bucket.frontend-bucket will be created
  + resource "google_storage_bucket" "frontend-bucket" {
      + effective_labels            = (known after apply)
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "ASIA-NORTHEAST1"
      + name                        = "web-iki"
      + project                     = "gig-japan-398904"
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = (known after apply)
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + lifecycle_rule {
          + action {
              + type = "Delete"
            }
          + condition {
              + age                   = 30
              + matches_prefix        = []
              + matches_storage_class = []
              + matches_suffix        = []
              + with_state            = (known after apply)
            }
        }

      + website {
          + main_page_suffix = "index.html"
          + not_found_page   = "404.html"
        }
    }

  # google_storage_bucket_iam_binding.frontend-sa-gcs will be created
  + resource "google_storage_bucket_iam_binding" "frontend-sa-gcs" {
      + bucket  = "web-iki"
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = [
          + "allUsers",
        ]
      + role    = "roles/storage.objectViewer"
    }

Plan: 2 to add, 1 to change, 5 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"summary_plan","PRNumber":69,"Program":"tfcmt","SHA1":"de20ed5c03287348ce98c2734ed908037eaa23eb","Vars":{},"WorkflowName":"iaac_plan"} -->